import React from 'react';
import SingleCard from './SingleCard';
import image1 from '../../assets/image/aboutus2.png';
import image2 from '../../assets/image/notice (1).png';
import image3 from '../../assets/image/POLICY_PUBLICATION-New.png';
import image4 from '../../assets/image/Eservice.png';
import image5 from '../../assets/image/Untitled.jpg';
import image6 from '../../assets/image/APA.png';
import image7 from '../../assets/image/nis_logo3.jpg';
import image8 from '../../assets/image/complain.png';
import image9 from '../../assets/image/infocom.png';
import image10 from '../../assets/image/INNOVATION (1).png';
import image11 from '../../assets/image/SPS-3.png';
import image12 from '../../assets/image/budget2 (1).png';
import image13 from '../../assets/image/FinalLogoSDG.png';
import image14 from '../../assets/image/forms.jpg';
import image15 from '../../assets/image/Untitled-edited-7.png';
import image16 from '../../assets/image/film.jpg';
import image17 from '../../assets/image/download (2).png';
import image18 from '../../assets/image/14n.jpg';
import image19 from '../../assets/image/Untitled-1.jpg';
import image20 from '../../assets/image/others.jpg';

const AllCards = () => {
    const cardsData = [
      {
        title: 'আমাদের বিষয়ে',
        points: [
          'আমাদের বিষয়ে',
          'ভিশন ও মিশন',
          'সাংগঠনিক কাঠামো',
          'কর্মকর্তাবৃন্দ',
          'কর্মবন্টন',
        ],
        image: image1,
      },
      {
        title: 'বিজ্ঞপ্তি/আদেশ/পরিপত্র',
        points: [
          'বিজ্ঞপ্তি/আদেশ/পরিপত্র',
          'প্রজ্ঞাপন/পরিপত্র',
          'অফিস আদেশ/বিদেশ ভ্রমণের জিও/পাসপোর্ট অনাপত্তিপত্র',
          'সংবাদ বিজ্ঞপ্তি',
          'দরপত্র/নিয়োগ বিজ্ঞপ্তি',
        ],
        image: image2,
      },
      {
        title: 'নীতিমালা ও প্রকাশনা',
        points: [
          'নীতিমালা ও প্রকাশনা',
          'নীতিমালা',
          'আইন ও বিধি',
          'প্রকাশনা ও বার্ষিক প্রতিবেদন',
          'বিভিন্ন প্রতিবেদন',
        ],
        image: image3,
      },
      {
        title: 'নাগরিক ই-সেবাসমূহ',
        points: [
          'নাগরিক ই-সেবাসমূহ',
          'বিদেশী চলচ্চিত্র আমদানির অনাপত্তি প্রদান।',
          'বেসরকারি মালিকানাধীন এফ এম বেতার কেন্দ্রের লাইসেন্স নবায়ন',
        ],
        image: image4,
      },
      {
        title: 'সেবা প্রদান প্রতিশ্রুতি',
        points: [
          'সেবা প্রদান প্রতিশ্রুতি',
          'ফোকাল পয়েন্ট কর্মকর্তা/পরিবীক্ষণ কমিটি',
          'কর্মপরিকল্পনা, পরিবীক্ষণ ও মূল্যায়ন প্রতিবেদন',
          'আইন/বিধি/নীতিমালা/পরিপত্র/নির্দেশিকা/প্রজ্ঞাপন',
        ],
        image: image5,
      },
      {
        title: 'বার্ষিক কর্মসম্পাদন চুক্তি',
        points: [
          'বার্ষিক কর্মসম্পাদন চুক্তি',
          'নির্দেশিকা/পরিপত্র/এপিএ টিম/ ফোকাল পয়েন্ট',
          'বার্ষিক কর্মসম্পাদন চুক্তি ও ফলাফল',
          'পরিবীক্ষণ ও মূল্যায়ন প্রতিবেদন',
          'এপিএএমএস সফটওয়্যার লিংক',
        ],
        image: image6,
      },
      {
        title: 'জাতীয় শুদ্ধাচার কৌশল',
        points: [
          'জাতীয় শুদ্ধাচার কৌশল',
          'উত্তম চর্চা কর্মপরিকল্পনা সফটওয়্যার লিংক',
          'নৈতিকতা কমিটি ও ফোকাল পয়েন্ট',
          'পরিবীক্ষণ ও মূল্যায়ন প্রতিবেদন',
          'আইন/বিধি/ নীতিমালা/নির্দেশিকা/ পরিপত্র/ প্রজ্ঞাপন',
        ],
        image: image7,
      },
      {
        title: 'অভিযোগ প্রতিকার ব্যবস্থাপনা',
        points: [
          'অভিযোগ প্রতিকার ব্যবস্থাপনা',
          'অনিক ও আপিল কর্মকর্তা',
          'কর্মপরিকল্পনা, পরিবীক্ষণ ও মূল্যায়ন প্রতিবেদন',
          'অভিযোগ দাখিল (অনলাইন)',
          'আইন/বিধি/নীতিমালা/পরিপত্র/প্রজ্ঞাপন/নির্দেশিকা',
        ],
        image: image8,
      },
      {
        title: 'তথ্য অধিকার',
        points: [
          'তথ্য অধিকার',
          'দায়িত্বপ্রাপ্ত কর্মকর্তা, আপিল কর্তৃপক্ষ',
          'কর্মপরিকল্পনা, আবেদন, আপিল, অভিযোগ ফরম ও সফটওয়্যার লিংক',
          'স্বপ্রণোদিতভাবে প্রকাশযোগ্য তথ্যসমূহ',
          'আইন/বিধি/নীতিমালা/পরিপত্র/প্রজ্ঞাপন/নির্দেশিকা',
        ],
        image: image9,
      },
      {
        title: 'উদ্ভাবনী কার্যক্রম',
        points: [
          'উদ্ভাবনী কার্যক্রম',
          'কর্মপরিকল্পনা/নির্দেশিকা/ প্রকল্পসমূহ',
          'ইনোভেশন টিম',
          'প্রজ্ঞাপন/পরিপত্র/নীতিমালা/সংকলন',
          'মূল্যায়ন প্রতিবেদন সফটওয়্যার লিংক',
        ],
        image: image10,
      },
      {
        title: 'সেবা সহজিকরণ',
        points: [
          'সেবা সহজিকরণ',
          'সেবা সহজিকরণ ম্যানুয়াল',
          'প্রজ্ঞাপন/পরিপত্র/নীতিমালা/অফিস আদেশ/সংকলন',
          'সহজিকৃত সেবার তালিকা',
          'সেবা সহজিকরণের দৃষ্টান্ত',
        ],
        image: image11,
      },
      {
        title: 'বাজেট ও প্রকল্প',
        points: [
          'বাজেট ও প্রকল্প',
          'বার্ষিক ক্রয় পরিকল্পনা',
          'বাজেট ও এমটিবিএফ বাজেট',
          'বাজেট প্রতিবেদন/অফিস আদেশ',
          'গুরুত্বপূর্ণ সমাপ্ত প্রকল্প সমূহ',
        ],
        image: image12,
      },
      {
        title: 'এসডিজি ও উন্নয়ন কর্মপরিকল্পনা',
        points: [
          'এসডিজি ও উন্নয়ন কর্মপরিকল্পনা',
          'মন্ত্রণালয়/বিভাগের এসডিজি',
          'এসডিজি ফোকাল / বিকল্প ফোকাল পয়েন্ট',
          'এসডিজি জাতীয় ডকুমেন্ট',
          'পঞ্চবার্ষিকী পরিকল্পনা ও প্রতিবেদন',
        ],
        image: image13,
      },
      {
        title: 'ফরমসমূহ',
        points: [
          'ফরমসমূহ',
          'সাংবাদিক কল্যাণ তহবিল আবেদন',
          'সকল সরকারি ফরম',
          'রিকুজিশন',
          'অন্যান্য',
        ],
        image: image14,
      },
      {
        title: 'সামাজিক নিরাপত্তা',
        points: [
          'সামাজিক নিরাপত্তা',
          'সমন্বয় ব্যবস্থাপনা',
          'কার্যক্রম',
          'প্রজ্ঞাপন/পরিপত্র/নীতিমালা',
        ],
        image: image15,
      },
      {
        title: 'চলচ্চিত্র',
        points: [
          'চলচ্চিত্র',
          'জাতীয় চলচ্চিত্র পুরস্কার / জুরি বোর্ড / সেন্সর বোর্ড',
          'যৌথ প্রযোজনায় চলচ্চিত্র নির্মান',
          'স্বল্পদৈর্ঘ্য চলচ্চিত্র নীতিমালা-২০১২',
          'অন্যান্য',
        ],
        image: image16,
      },
      {
        title: 'টেলিভিশন',
        points: [
          'টেলিভিশন',
          'অনাপত্তি প্রদানকৃত দেশি ও বিদেশি টেলিভিশন চ্যানেল এর তালিকা',
          'জাতীয় সম্প্রচার নীতিমালা',
          'অনুমোদিত আইপি টিভির তালিকা',
          'অন্যান্য',
        ],
        image: image17,
      },
      {
        title: 'প্রেস',
        points: [
          'প্রেস',
          'সরকারি মিডিয়াভুক্ত সংবাদপত্রের তালিকা',
          'আইন,বিধি,নীতিমালা,পরিপত্র, নির্দেশিকা ও প্রজ্ঞাপন',
          'অনুমোদনকৃত অনলাইন পোর্টাল ও দৈনিক অনলাইন নিউজ পোর্টালের তালিকা',
          'ক্রোড়পত্র প্রকাশ সংক্রান্ত কার্যক্রমের ধাপসমূহ',
        ],
        image: image18,
      },
      {
        title: 'আইন/নীতিমালা',
        points: [
          'আইন/নীতিমালা',
          'জাতীয় সম্প্রচার নীতিমালা',
          'ক্যাবল টিভি বিধিমালা-২০১০',
          'সাংবাদিক কল্যাণ ট্রাস্ট বিধিমালা',
          'অন্যান্য',
        ],
        image: image19,
      },
      {
        title: 'বিবিধ',
        points: [
          'বিবিধ',
          'বার্ষিক প্রতিবেদন',
          'টেন্ডার',
          'ফটোগ্যালারী',
          'অন্যান্য',
        ],
        image: image20,
      },
    ];

    return (
      <div className="container mx-auto flex flex-wrap gap-4 justify-center py-8">
        {/* <div className="container mx-auto grid grid-cols-1 md:grid-cols-2 lg:grid-cols-4 gap-8 py-8"> */}
        {cardsData.map((card, index) => (
          <SingleCard
            key={index}
            title={card.title}
            points={card.points}
            image={card.image}
          />
        ))}
      </div>
    );
};

export default AllCards;